In [1]:
import pandas as pd

In [2]:
data=[1,2,3,4,5]

In [3]:
data

[1, 2, 3, 4, 5]

In [5]:
df=pd.DataFrame(data,columns=['num1'])
df

   num1
0     1
1     2
2     3
3     4
4     5

In [ ]:
#dataframe to series convert


s=df['num1']

In [7]:
s

0    1
1    2
2    3
3    4
4    5
Name: num1, dtype: int64

In [8]:
#Create a series for 2 integer columns
data2=[[1,2],[3,4],[5,8]]
data2

[[1, 2], [3, 4], [5, 8]]

In [10]:
df2=pd.DataFrame(data2,columns=["num1","num2"])
df2

   num1  num2
0     1     2
1     3     4
2     5     8

In [13]:
#Create a series from dataframe
s=df2[["num1","num2"]]
s

   num1  num2
0     1     2
1     3     4
2     5     8